[
  {
    "id": 1,
    "title": "Countryball - Space Race",
    "description": "My first commercially released game <u>ever</u>.<br><br> A childhood dream. I'm so proud of it because it was a long process on all levels of video game conception, especially <b>Game Design</b>. I learned so much while developing it that I couldn't conceive it, and I understand why in the world of computer science and especially in the world of video games, there is a huge difference between a <b>finished game</b> and an incomplete one. <br><br>Anyway, it's a game where you have to draw platforms to help a country go as high as possible, even reach space. However, the rocket at your disposal is useless, and your platform fuel is limited. So, you'll have to scrape together coins to upgrade everything and go higher and higher! You can try it right here on the <a href='https://play.google.com/store/apps/details?id=com.TheCauldron.CountryBallSpaceRace'>Play Store</a>.",
    "languages": "C# / SQL",
    "preview": "images/Countryball.png",
    "technos": "Unity / .NET / Blender",
    "time": "2023",
    "roles": "Game Designer / Programmer / Artist",
    "videos": ["https://www.youtube.com/embed/9-ScZOiRGV4", "https://www.youtube.com/embed/9-bsy0Sv_N4"],
    "gallery": ["images/screens/Kit.png", "images/screens/countryball1.png","images/screens/countryball2.jpg","images/screens/countryball3.jpg","images/screens/countryball4.jpg","images/screens/countryball5.jpg","images/screens/countryball6.jpg"]
  },
  {
    "id": 2,
    "title": "PlanQuiz",
    "description": "It all started when someone challenged me to create a quiz game on a rainy Sunday morning. With our friends, we love quizzes, but online ones are either boring or poorly made. So, I quickly put together a quiz editor and an online quiz that simply displayed the questions.<br><br> And that's how <b>PlanQuiz</b> was born, a multiplayer and collaborative quiz game. As it evolved, I thought of making a public version for everyone to play as well. It's quite a project, and although it could use some graphical improvements, I'm really proud of it. <a href='http://www.planquiz.fr'> Why not give it a try </a>?",
    "languages": "C# / SQL / JavaScript",
    "preview": "images/PlanQuiz.png",
    "technos": "Unity / WebGL / Web Sockets",
    "time": "2022",
    "roles": "Game Designer / Programmer / UI Designer",
    "videos": ["https://www.youtube.com/embed/IMNEQfj-erY"],
    "gallery": [
      "images/screens/planquiz4.png",
      "images/screens/planquiz5.png",
      "images/screens/planquiz6.png",
      "images/screens/planquiz7.png",
      "images/screens/planquiz8.png",
      "images/screens/planquiz9.png",
      "images/screens/planquiz2.png",
      "images/screens/planquiz3.png"
    ]
  },
  {
    "id": 3,
    "title": "Flappy Bird Online",
    "description": "I was looking for an idea for my <a href='https://www.youtube.com/@theunknownbox2254'>YouTube channel</a>, and then it hit me: <b>Flappy Bird</b>. In <b>3D</b>. And <b>Online</b>. And that's it.<br><br> I started with some 3D models, reused a server from a previous game, and it was done. The cool thing about this project was that it was an opportunity to add a little bit of polish, as there was nothing too complicated. I could play with the lighting, the effects, etc... <br><br>Despite the apparent simplicity of the project, I loved working on it. And my friends and I play it very <u>often</u>!<br><br> You can try it <a href = 'http://82.64.152.244:888/FlappyBird/'>here</a>",
    "languages": "C# / SQL",
    "preview": "images/Flappy Bird.png",
    "technos": "Unity / Blender",
    "time": "2022",
    "roles": "Game Designer / Programmer / Artist",
    "videos": ["https://www.youtube.com/embed/4zFF2D6G4fo"],
    "gallery": ["images/screens/FlappyBird1.png","images/screens/FlappyBird2.png"]
  },
  {
    "id": 4,
    "title": "Cat Clicker",
    "description": "Recently, I got back into web development thanks to a friend, and since she was learning <b>Javascript</b>, I suggested we work on a project together. So, we made a clone of <b>Cookie Clicker</b>, but with cats.<br><br> She worked on the front-end while I handled the back-end (with her participation). While we added some original features, we followed the structure and formulas of the original game because the goal was not to create a game but to practice!<br><br> You can try on her <a href = 'https://tiffanydurr.github.io/Cookie-Clicker/'>Github</a> !",
    "languages": "JavaScript / HTML / CSS",
    "preview": "images/Cat-Clicker.png",
    "technos": "VSCode",
    "time": "2022",
    "roles": "Game Designer / Programmer",
    "videos": [],
    "gallery": ["images/screens/catclicker1.png", "images/screens/catclicker2.png"]
  },
  {
    "id": 5,
    "title": "Platform Drawer",
    "description": "Typically the kind of concept that is simple but with enormous possibilities.<br><br> It is possible to draw platforms and each of them has different properties! Not much to say about it, there is a whole video about it that explains it much better. Actually, it was much easier than I thought. I thought the generation of platforms would be more complex and harder to manage, but in the end, it wasn't. <br><br> There is no gameplay but I find this still funny to play, only for the physics.<br><br> <a href='http://82.64.152.244:888/PlatformDrawer/'>Play it here</a>",
    "languages": "C#",
    "preview": "images/PlatDraw.png",
    "technos": "Unity",
    "time": "2020",
    "roles": "Game Designer / Programmer",
    "videos": ["https://www.youtube.com/embed/T8mb7D6vk5Y","https://www.youtube.com/embed/5icsVNGsbRA"],
    "gallery": []
  },
  {
    "id": 6,
    "title": "Game of Life 3D",
    "description": "I'm a huge fan of the <b>Game of Life</b> (who isn't?). And for the first video on my <a href='https://www.youtube.com/@theunknownbox2254'>YouTube channel</a>, I wanted to see how to represent it in 3D, with a polished look and cool features. Not much else to say, but I'm really happy with the result!",
    "languages": "C#",
    "preview": "images/GoL3D.png",
    "technos": "Unity",
    "time": "2019",
    "roles": "Programmer",
    "videos": ["https://www.youtube.com/embed/CH4oy2ewzLc"],
    "gallery": []
  },
  {
    "id": 7,
    "title": "Earth Generator",
    "description": "Just another 'hey, what if we could do this' story. I was looking for concepts for my <a href='https://www.youtube.com/@theunknownbox2254'>YouTube channel</a> and wondered how it would be possible to generate a world map in <b>Unity</b>.<br><br> I found suitable data and set about the task of generating it all. And for the video, I needed data, so being in the midst of <b>Covid</b>, I simply displayed real-time <b>Covid</b> data. My only regret is that I didn't have time to do it in 3D, despite some encouraging tests!",
    "languages": "C# / JavaScript",
    "preview": "images/CovidMap.png",
    "technos": "Unity / APIs",
    "time": "2020",
    "roles": "Programmer",
    "videos": ["https://www.youtube.com/embed/KR48wqOODtw"],
    "gallery": ["images/screens/worldgen.png","images/screens/worldgen3D.png"]
  },
  {
    "id": 8,
    "title": "ROSE Online Emulator",
    "description": "Where to begin... <b>Rose Online</b> is a game that I have a long-standing relationship with. I've been a huge player since 2005, and it's thanks to this game that I started delving into programming. It was on this game that I encountered my first hacker, and it fascinated me to see people who weren't restricted by the game's rules.<br> When the official servers closed, players were left high and dry and started wanting to create private servers. It became a race to see who would make the first true Rose emulator. Since I was just starting out in programming and knew the game well, I naturally started working on a community emulator project. So, that's how I got into programming, by creating an emulator. It's probably the worst way to start programming, but you have to start somewhere! However, the official source code leaked, so there was no need for an emulator anymore. <br><br>Finally, during the <b>Covid</b> lockdown, I had some time to kill, and after years of experience, I wanted to challenge myself: to recreate a <b>Rose emulator</b> from scratch! And after weeks and weeks of hard work, I FINALLY managed to make something that works.",
    "languages": "C# / C++ / SQL",
    "preview": "images/Rose Online.png",
    "technos": ".NET / Disassembler / Hex Editor",
    "time": "2020",
    "roles": "Programmer / Reverse Engineer",
    "videos": ["https://www.youtube.com/embed/L1FbSORjwzM"],
    "gallery": ["images/screens/rose1.jpg"]
  },
  {
    "id": 9,
    "title": "Discord Arena",
    "description": "I love coming up with concepts, and this one was a biggie. I wanted to create interactions between the <b>Discord</b> API and a <b>Unity</b> game, not just one-way interactions like we usually see, but in both directions. <br><br>After finding a library that could do it but was in bad shape and outdated, I decided to update and fix it for days. Then, I created a game prototype to put my ideas into practice. Server users are represented by their attributes, roles, whether they are bots or not, in voice channel, etc.. <br><br>Didn't have time to create an interesting gameplay since the <b>Discord</b> part took up a lot of time, but just seeing the small interactions made it worthwhile. <br><br> I hope to see games like this emerge in the future since it got a lot of potentiel.",
    "languages": "C#",
    "preview": "images/Discord Arena.png",
    "technos": "Unity / DiscordUnity (personnal)",
    "time": "2021",
    "roles": "Programmer",
    "videos": ["https://www.youtube.com/embed/oOv8dZ8XaTs"],
    "gallery": ["images/screens/discordarena.png"]
  },
  {
    "id": 10,
    "title": "Music Jam",
    "description": "Here's a sad story 😥.<br><br> I really love <b>rhythm games</b>, or games that use music as a source of gameplay. However, a question kept bothering me: Why were the notes always handcrafted? Wasn't there a way to generate them gracefully using code? I tried to find the answer to this question. <br><br>And after many tests, it turned out to be <u>impossible</u>. Maybe it's just me being bad at this, but after days of testing and reading about the topic, I had to accept it.",
    "languages": "C#",
    "preview": "images/MusicJam.png",
    "technos": "Unity / Audacity",
    "time": "2022",
    "roles": "Programmer",
    "videos": ["https://www.youtube.com/embed/S2ygZJJoAcU"],
    "gallery": []
  },
  {
    "id": 11,
    "title": "Discord Bots",
    "description": "Since migrating from <b>Skype</b> to <b>Discord</b>, I've been fascinated by bots. And since I started early, bots were still in their debuts and lacked many features. Naturally, I thought about creating my own.<br><br> <b>Akrelia</b> is the bot for my own server. It can moderate, conduct polls, track user activity with an XP point system, and much more.<br><br> <b>Selene</b> is a bot for the game <a href='https://www.erepublik.com/fr'>eRepublik</a>, which collects data, sends battle notifications, and provides player information.<br><br> Lastly, <b>Betty</b> is the most advanced: it allows sports betting on <b>Football</b> matches! It's one-of-a-kind and manages every major competition, showing who bet on which match, the results, and allows users to earn points. During each major football competition, we hold a contest using <b>Betty</b>, and it's always a big event for me and my friends",
    "languages": "C# / JavaScript / SQL",
    "preview": "images/DiscordBots.png",
    "technos": "Discord.NET / FootballAPI (mine) / APIs",
    "time": "Since 2018",
    "roles": "Programmer",
    "videos": [],
    "gallery": [
      "images/screens/discord1.png",
      "images/screens/discord2.png",
      "images/screens/discord3.png",
      "images/screens/discord4.png",
      "images/screens/discord5.png",
      "images/screens/discord6.png",
      "images/screens/discord7.png",
      "images/screens/discord8.png",
      "images/screens/discord10.png"
    ]
  },
  {
    "id": 12,
    "title": "Meteor Messenger",
    "description": "My own Messenger! It has been a dream since I started coding, I wanted to create my own messaging platform to connect people.<br><br> <b>Meteor</b> went through various phases, as it was my first step into network programming. I learned so much about this aspect along the way, through trial and error (and there were plenty of them). It was possible to chat, add contacts, connect to <b>RSS</b> feeds and share them, use custom emojis, and more...",
    "languages": "C# / SQL",
    "preview": "images/Meteor.png",
    "technos": "WinForms / .NET",
    "time": "2015",
    "roles": "Programmer / UI Designer",
    "videos": [],
    "gallery": ["images/screens/meteor1.png", "images/screens/meteor2.png", "images/screens/meteor3.png", "images/screens/meteor4.png", "images/screens/meteor5.png", "images/screens/meteor6.png"]
  },
  {
    "id": 13,
    "title": "Arcturus GO",
    "description": "Once on <b>Github</b>, I stumbled upon a very rudimentary and clumsy emulator of <b>Pokémon GO</b>, and I became interested in its structure.<br><br> As I studied the emulator and the game itself, I came up with an idea to create a prototype that would capture the unique gameplay of <b>Pokémon GO</b>. <br><br>After creating the server (which was the longest part), I designed a small game where players could place and name their own planet. It was impossible for another player to place their planet within 20 meters of another player's. To interact with the planet, such as harvesting generated resources, one had to be at the exact location.<br><br> I don't have much to show of the game, but it was undoubtedly an incredible experience, and I have a ready-made structure for such a game up my sleeve !",
    "languages": "C# / SQL",
    "preview": "images/OGameGO.png",
    "technos": "Unity / ProtoBuf",
    "time": "2019",
    "roles": "Programmer",
    "videos": ["https://www.youtube.com/embed/6vWSJewzQwQ"],
    "gallery": []
  },
  {
    "id": 14,
    "title": "Space Janitor",
    "description": "It was supposed to be my very first commercial game, as I had just delved into game development seriously.<br><br> However, I clearly lacked experience, not in terms of coding, but in terms of game design. <b>Space Janitor</b> is a <b>Tower Defense</b> game set around the surface of a planet! You have to fend off waves of enemies coming from space by placing towers and utilizing available weapons.<br><br> The game was built using pure <b>MonoGame</b>, which was quite a challenge, especially when it came to the UI.",
    "languages": "C#",
    "preview": "images/Space Janitor.png",
    "technos": "Monogame / Personal Engine & Tools",
    "time": "2016",
    "roles": "Game Designer / Programmer / Artist",
    "videos": ["https://www.youtube.com/embed/izMmF-a45aw","https://www.youtube.com/embed/nl9YaRtOW90"],
    "gallery": ["images/screens/spacejanitor.png"]
  },
  {
    "id": 15,
    "title": "The Defenders",
    "description": "It's a small prototype I made with an acquaintance. Although I'm proficient in <b>Unity</b>, I had never really dabbled in this kind of game and it intrigued me.<br><br> So we decided to create a sort of prototype with elements of <b>Tower Defense</b>, <b>Third Person Shooter</b>, and a touch of <b>Rogue Like</b>. Then we thought about including a multiplayer mode, as it suited well. This project remained just a prototype, but it was very interesting to work on.",
    "languages": "C#",
    "preview": "images/TheDefenders.png",
    "technos": "Unity",
    "time": "2019",
    "roles": "Programmer",
    "videos": ["https://www.youtube.com/embed/qgGJtlRPXwg"],
    "gallery": ["images/screens/thedefenders1.png", "images/screens/thedefenders2.png"]
  },
  {
    "id": 16,
    "title": "3D Modeling",
    "description": "My adventure with <b>Blender 3D</b>!<br><br> I'm still a beginner, and I regret not starting 3D modeling earlier. Actually, I find <b>3D</b> even easier than <b>2D</b>, especially for a programmer like me. I'm finally gaining the skills to use my creations in my projects (mostly <b>Low-Poly</b> style), and I'm excited to learn more!.",
    "languages": "Python",
    "preview": "images/3D.png",
    "technos": "Blender / Paint Substance",
    "time": "Since 2021",
    "roles": "3D Artist",
    "videos": ["https://www.youtube.com/embed/DQliALlP_jg","https://www.youtube.com/embed/8rtVmc6m3Rc"],
    "gallery": ["images/screens/treasure.png", "images/screens/treasure2.png", "images/screens/room.png", "images/screens/tiny planet.png", "images/screens/cimetery.png", "images/screens/chess.png"]
  },
  {
    "id": 17,
    "title": "Miscellaneous",
    "description": "Here's the little miscellaneous section! <br><br>Throughout my professional and personal journey, I've had the opportunity to try out a bunch of small projects that have allowed me to learn a lot. And I believe that a developer should always keep that spark to constantly add more strings to their bow.<br><br>Some things may be a bit old but still relevant, so I still include them.",
    "languages": "C# / JavaScript / C++ / Java",
    "preview": "images/Misc.png",
    "technos": "Unity / .NET / MonoGame",
    "time": "Since 2010",
    "roles": "Game Designer / Programmer / Artist",
    "videos": ["https://www.youtube.com/embed/jpbhV645iog","https://www.youtube.com/embed/8k8pvY4bw-c","https://www.youtube.com/embed/7BCuxZo3Uow", "https://www.youtube.com/embed/bmHW2Ishpsk", "https://www.youtube.com/embed/eVFbzqYke0c"],
    "gallery": [
      "images/screens/towerdefense3D.png",
      "images/screens/tower-def-js.png",
      "images/screens/arcturus-world.png",
      "images/screens/akrelia.png",
      "images/screens/Competz.png",
      "images/screens/dungeon-explorer.png",
      "images/screens/tetris.png",
      "images/screens/tower-def1.png"
    ]
  }
]
